---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.CheckerColor2
source: html/d78f507e-d68f-b0b2-f2f0-abfc0da722de.htm
---
# Autodesk.Revit.DB.Visual.Checker.CheckerColor2 Property

The property labeled "Color 2" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string CheckerColor2 { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.